import sys

def menu():
    data = [" 1. Просмотр ", " 2. Добавить ", " 3. Искать ", " 4. Редактировать ", " 5. Удалить ", " 6. Импорт ", " 7. Экспорт ", " 8. Exit "]
    form = '-' * 14 + '+' + '-' * 13 + '+' + '-' * 11 + '+' + '-' * 18 + '+' + '-' * 12 + '+' + '-' * 11 + '+' + '-' * 12 + '+' + '-' * 10
    return form +'\n|{0:}|{1:}|{2:}|{3:}|{4:}|{5:}|{6:}|{7:}|'.format(*data) + '\n' + form
    # return input("Пожалуйста, сделайте выбор: ")


def sub_menu_export():
    print("\n\n\nДля экспорта данных пожалуйста выберите формат из представленных ниже.")
    data = [" 1. Html ", " 2. Json ", " 3. Назад "]   
    form = '-' * 10 + '+' + '-' * 9 + '+' + '-' * 11 
    print(form + '\n|{0:}|{1:}|{2:}|'.format(*data) + '\n' + form)
    return input("Пожалуйста, сделайте выбор: ")


def hi():
    return '\nПривет, добро пожаловать в наш маленький справочник (^-^)\n'


def bye():    
	print("**************************************************")
	print("Спасибо что воспользовались нашим справочником")
	print("Будем рады видеть Вас снова!")
	print("**************************************************")
	sys.exit("\nХорошего дня!")

